#  1) Вывести на экран число "10" 20 раз столбиком.

# for i in range(20):
#     print(10)

# 2) 2.	Даны два числа a и b. Составить программу вывода на экран всех чисел от a до b.

# for i in range(0,10,2):
#      print(i)

# 3) 3.	Дано число N. Составить программу выводящую кубы чисел от 1 до N в одну строку.

# for number in range(1,10):
#     if number % 1 == 0:
#       print(number**3, end=" ")

# 4) Выведите на экран в одну строку числа от 100 до
# -100 включительно.

# for numb in range(100,-101,-1):
#     print(numb, end=" ")

# 5) 5.	Необходимо вывести все четные числа на отрезке [a; a * 10]

# for numb in range(0,10):
#         print(numb**10,end=" ")

